{
  "Your account": "Contul tau",
  "Nice, you're a paying subscriber!": "Super, esti abonat!",
  "You've an active account with access to all areas. You're all set, but if you need any help, get in touch with us and we'd be happy to help.": "Contul tau este activ, cu acces la toate zonele. Totul este pregatit, insa daca ai nevoie de ajutor ne poti contacta si vom fi fericiti sa facem asta.",
  "Email address": "Adresa de email",
  "Your plan": "Planul tau",
  "Card": "Card",
  "Expires": "Expira",
  "Next bill date": "Urmatoarea data a facturii",
  "Edit billing info": "Editeaza informatiile de plata",
  "Your subscription will expire on": "Abonamentul tau va expira pe",
  "If you change your mind in the meantime you can turn auto-renew back on to continue your subscription.": "In caz ca te vei razgandi, poti porni reinnoirea automata pentru a continua abonamentul",
  "The latest posts only for paying subscribers": "Ultimele postari doar pentru abonati",
  "Currently, you're not a paying subscriber.": "Momentan nu esti abonat",
  "You've an active account with access to posts for subscribers only. Upgrade your account and get access to the full library of posts.": "Contul tau este activ, cu acces la postarile doar pentru abonati. Actualizeaza-ti contul pentru a avea acces la toate postarile.",
  "Free": "Gratuit",
  "Not available": "Nu este disponibil",
  "Author's latest posts:": "Ultimele postari ale autorului:",
  "More posts? Choose your plan": "Mai multe postari? Alege-ti abonamentul",
  "The Executive Team": "Echipa de membri executivi",
  "Tell us more about": "Spune-ne mai multe despre",
  "yourself": "tine",
  "Whether you have questions or you would just like to say hello, contact us.": "Fie ca ai intrebari sau doar vrei sa ne saluti, contacteaza-ne!",
  "Name": "Nume",
  "Email here": "Adresa de email",
  "Your message": "Mesajul tau",
  "Send Message": "Trimite mesajul",
  "Pick the best plan for you": "Alege planul potrivit pentru tine",
  "Unlock full access to {blogtitle} and see the entire library of subscribers only content & updates": "Deblocheaza accesul total la {blogtitle} si poti vedea intreaga biblioteca de continut doar pentru abonati & noutati",
  "Already have an account?": "Ai deja un cont?",
  "Sign in": "Logheaza-te",
  "Sign out": "Delogheaza-te",
  "Sign up": "Inregistreaza-te",
  "Sign up now": "Inregistreaza-te acum",
  "More countent with our": "Mai mult continut cu",
  "Newsletter": "Newsletter",
  "We aim high at being focused on building relationships with our community. Using our creative gifts drives this foundation.": "Tintim sus in ceea ce priveste relatia cu comunitatea noastra. Folosirea talentului nostru creativ este ceea ce tine in picioare aceasta fundatie.",
  "Your email address": "Adresa ta de email",
  "Subscribe": "Alatura-te",
  "Great!" : "Super!",
  "Check your inbox and click the link to confirm your subscription": "Verifica-ti emailul si apasa pe link pentru a-ti confirma abonamentul",
  "Our most used tags:": "Cele mai folosite taguri ale nostre",
  "Other cool tags:": "Alte taguri cool",
  "Back to Homepage": "Inapoi la pagina de pornire",
  "Welcome Back!": "Bine ai revenit!",
  "Sign into your account using your email address": "Intra in cont cu adresa de email",
  "Send login link": "Trimite link pentru a intra in cont",
  "Check your inbox and click the link to complete signin": "Verifica-ti inbox-ul si apasa pe link pentru a termina inregistrarea",
  "Hello, Friend!": "Salut, prietene!",
  "Enter your e-mail address and start your journey with us": "Scrie-ti adresa de email si incepe calatoria cu noi",
  "Check your inbox and click the link to confirm your signup": "Verifica-ti inbox-ul si apasa pe link pentru a confirma inregistrarea",
  "Subscribe to our Newsletter": "Aboneaza-te la Newsletter",
  "Join our newsletter and get news in your inbox every week! We hate spam too, so no worries about this.": "Alatura-te Newsletterului nostru informativ si primeste noutati in inbox-ul tau in fiecare saptamana! Nici noua nu ne place spam-ul, deci nu iti face griji!",
  "and others": "si altii",
  "Pay for content.": "Plateste pentru continut",
  "This post is for paying subscribers only": "Aceasta postare este doar pentru abonati",
  "Sign up now and upgrade your account to read the post and get access to the full library of posts for paying subscribers only.": "Inscrie-te acum si actualizeaza-ti contul pentru a citi aceasta postare si a avea acces la biblioteca completa doar pentru abonati. ",
  "Account": "Cont",
  "Get started": "Incepe",
  "Monthly": "Lunar",
  "Yearly": "Anual",
  "Processing your application": "Aplicatie in procesare",
  "There was an error sending the email, please try again": "A aparut o eroare trimitand acest email, te rog incearca dinnou",
  "Show more": "Arata mai mult",
  "This post was a collaboration between:": "Aceasta postare a fost o colaborare intre",
  "Read more posts by this author": "Citeste mai multe postari de la acest autor",
  "Previous Post": "Postarea precedenta",
  "Next Post": "Urmatoarea postare",
  "Thank you for your support!": "Iti multumim pentru sustinere!",
  "Read more": "Citeste mai mult",
  "Thank you for supporting us!": "Iti multumim pentru ca ne sustii!",
  "Let's get in touch on any of these platforms.": "Putem comunica pe una dintre urmatoarele platforme."
}